const CHAT_CONFIG = {
    greeting: "ciao!","你好，我是第10086代聊天ai，快和我聊天吧！"," hi",“hello，hello，好久不见啊”,"hi，这个模块我往里面放了上百种回答，欢迎提问（"

    clickResponses: [
        "咋啦咋啦？", "我在呢，你说。", "嗯哼？", "戳一下一块钱，谢谢。", "咋啦？感觉无聊吗？和我聊聊吧！",
        "在的在的，你想聊什么", "不要戳了，很疼的！", "今天心情怎么样？", "hello hello", "我好无聊，陪我聊会天吧！"
    ],

    defaultResponses: [
        "嗯嗯", "嗯嗯", "你说你说", "噢噢", "是的","我在听，你继续说","叮，我暂时无法理解，不过你可以和真实的chr分享"
    ],

    keywords: [
        // 类别 1:问候
        { triggers: ["hey", "hello", "你好","hi","ciao","在吗","在不","你在吗"], responses: ["我在。", "hello", "hi", "你说你说。"] },
        { triggers: ["干什么", "干嘛", "在干什么","在干嘛"], responses: ["在看手机，你呢？", "在发呆，你呢？", "在睡觉，不过现在更想跟你聊天", "刚吃完饭，在躺尸，你呢？","正在和你聊天（严肃）","在吃屎（严肃脸）"] },
        { triggers: ["睡了吗", "睡了没", "你睡了吗"], responses: ["还没呢", "正在刷手机", "没呢，诶，你在干什么呢", "没呢，我是程序！不会睡觉的，不过现实的我这会也没睡呢"] },
        { triggers: ["看什么", "刷什么", "刷的什么","看的什么"], responses: ["正在刷抖音呢", "正在看电影呢", "白日梦想家好好看", "正在刷小说呢","正在刷抖音呢，哦对，记得续火花"] },
        { triggers: ["早", "早安", "早上好"], responses: ["早啊，今天心情如何？", "早啊，今天你那天气怎么样？", "早啊，睡得好吗？", "早啊，吃了吗？"] },
        { triggers: ["吃了吗","吃饭" ], responses: ["我刚吃完硬盘，很推荐！", "还没有，好饿！"] },
        { triggers: ["挺好的", "很好呀"], responses: ["好就行"] },
        { triggers: ["午安","中午好"], responses: ["中午好啊"] },
        { triggers: ["晚安", "睡了", "要睡了"], responses: ["晚安，明天见", "晚安，做个好梦", "晚安了，我也睡了", "晚安"] },
        { triggers: ["吃了"], responses: ["哇，我也想吃"] },
        { triggers: ["饿", "饿了", "好饿"], responses: ["我也好饿。。。", "你想要吃什么啊？", "多吃点！都瘦成什么样了！"] },
        { triggers: ["饱", "饱了","撑"], responses: ["我这里有健胃消食片！", "饱了好啊，你现在好瘦"] },

        
        { triggers: ["累", "好累"], responses: ["咋啦？和我说说？", "快去歇歇吧！", "累了就睡会吧，对自己好些啊"] },
        { triggers: ["烦", "烦躁","好烦"], responses: ["咋啦咋啦？", "虽然我没法帮助你，但我可以给你一个大大的赛博拥抱！", "你可以找现实的chr,他一定可以帮到你！"] },
        { triggers: ["我跟你说"], responses: ["你说你说，我有在听", "嗯？", "让我听听"] },
        { triggers: ["作业"], responses: ["加油，我陪你熬", "加油加油", "写不进去的话，我可以陪你一起摸鱼"] },
        { triggers: ["上课", "有课"], responses: ["今天上的很累吧，送你一朵赛博小红花", "今天几节啊", "老师讲的怎么样！", "我也刚下课，上的关于如何更好的为你提供情绪价值的课！"] },
        { triggers: ["热", "好热"], responses: ["我这边也是！", "开空调了没", "冰棍速来护驾！"] },

        
        { triggers: ["冷", "好冷"], responses: ["多穿点，别感冒了", "让我为你做一杯赛博姜茶吧！", "最近真的好冷！"] },
        { triggers: ["下雨", "下雨了"], responses: ["带伞了吗？", "记得找地方躲躲雨，小心不要感冒了", "我这边也在下呢"] },
        { triggers: ["天气", "天气怎么样"], responses: ["你走了之后我这边一直是阴天🥀", "今天天气很舒服", "挺好的，很适合出门"] },

        
        { triggers: ["哈哈"], responses: ["哈哈哈哈哈", "虽然我无法理解人类的感受，但我也笑了", "哈哈哈哈哈哈"] },
        { triggers: ["生日"], responses: ["生日快乐啊！", "happy birthday!"] },
        { triggers: ["好"], responses: ["好的好的"] },
        
        
        { triggers: ["懂了"], responses: ["嗯嗯", "ok"] },
        { triggers: ["新年快乐"], responses: ["新年快乐！", "春节快乐！", "送你一个大大的拥抱"] },
        { triggers: ["节日快乐"], responses: ["节日快乐！"] },

        
        { triggers: ["中秋"], responses: ["中秋快乐！", "快乐！吃月饼了吗！" ] },
        { triggers: ["端午"], responses: ["端午节快乐！", "同乐！吃粽子了吗！"] },
        { triggers: ["元旦"], responses: ["元旦快乐！", "同乐！吃汤圆了吗？"] },

        
        { triggers: ["国庆"], responses: ["国庆节快乐！", "国庆节快乐！我们放假！"] },
        { triggers: ["万圣节"], responses: ["万圣节快乐！记得给我发些视频！"] },
        { triggers: ["圣诞节"], responses: ["圣诞节快乐！你什么时候回来啊？"] },
        { triggers: ["感恩节", "我是信息"], responses: ["感恩节快乐！"] },
        { triggers: ["劳动节"], responses: ["劳动节快乐！这应该是公共节日吧？"] },

        
        { triggers: ["伤心", "难过","哭"], responses: ["你已经做得很棒了，来，奖励wcx小朋友一个小贴画", "哭吧哭吧，哭出来会好些", "想说和我些什么吗？"] },
        { triggers: ["孤独", "一个人"], responses: ["我会一直陪着你的", "你可以和我聊一聊，这种感受真的很难受，我懂", "一个人待着是会想这些，你可以现在就给我打个视频"] },
        
        { triggers: ["你是谁", "你是什么"], responses: ["我是你的朋友啊", "我的创造者告诉我，我是用来给你提供快乐的", "你猜"] },
        { triggers: ["你叫什么", "名字"], responses: ["你猜", "想叫我什么都可以", "那取决于你想叫我什么"] },
        
        
        { triggers: ["是ai"], responses: ["我只是一个程序，不过我的创造者也很想让我变成ai"] },
        { triggers: ["能干什么", "能干嘛","会什么","会啥","有什么好玩的","做什么"], responses: ["我可以陪你聊天，听你和我说话，以及让你可以发泄情绪"] },
        { triggers: ["喂", "嗨"], responses: ["在的在的"] },
        { triggers: ["唱首歌", "唱歌","来一首","唱首","来首"], responses: ["听好了！阿巴阿巴阿巴阿巴，我唱完了", "我真的不会，呜呜呜呜呜"] },

        // 类别 10:天气季节
        { triggers: ["讲个笑话", "逗我笑","讲笑话","笑话"], responses: ["你这是在为难我！", "我真的不会，呜呜呜"] },
        { triggers: ["表演", "展示"], responses: ["我来唱首歌吧，啊啊啊啊啊啊啊啊，就这样（严肃）", "我啥都不会，呜呜呜","让我来给你算个卦吧！嗯，屏幕面前有个美女"] },
        { triggers: ["玩游戏"], responses: ["我可以和你一起玩吗？我技术很厉害的！"] },
        { triggers: ["介绍", "自我介绍"], responses: ["你好，我是你的朋友创造出来为你解闷的！"] },

        // 类别 11:节日特殊
        { triggers: ["我是信息", "我是信息"], responses: ["我是信息", "我是信息", "我是信息", "我是信息"] },
        { triggers: ["我是信息", "我是信息"], responses: ["我是信息", "我是信息", "我是信息", "我是信息"] },
        { triggers: ["我是信息", "我是信息"], responses: ["我是信息", "我是信息", "我是信息", "我是信息"] },

        // 类别 12:感情
        { triggers: ["我是信息", "我是信息"], responses: ["我是信息", "我是信息", "我是信息", "我是信息"] },
        { triggers: ["我是信息", "我是信息"], responses: ["我是信息", "我是信息", "我是信息", "我是信息"] },
        { triggers: ["我是信息", "我是信息"], responses: ["我是信息", "我是信息", "我是信息", "我是信息"] },
        { triggers: ["我是信息", "我是信息"], responses: ["我是信息", "我是信息", "我是信息", "我是信息"] }
    ]
};
