const MESSAGES = {
    apple: [
        "【一天一个苹果，医生远离我！】",
        "【苹果+1，今天营养已达标】",
        "【哇，这个水分好多】",
        "【又一颗，牙口真好】",
        "【健康+1】",
        "【这个不长胖，放心吃】"
    ],
    star: [
        "【抓住了！快许个愿吧！】",
        "【look how they shine for you⁓】",
        "【我已闪亮登场】",
        "【加油加油！！！】" ,
        "【诶！是星星诶，好美！】"
    ],
    heart: [
        "【叮咚，好感度+1】",
        "【收到了！】",
        "【叮！生命+1】"
    ],
    poop: [
        "【傻瓜！这个不能吃！】",
        "【emmmm，算你狠！】",
        "【吃点别的吧，求求你了。。。】" ,
        "【形象 -999，勇气 +9999】",
        "【真有这么好吃吗？】"
    ],
    hitWall: [
        "【吹一吹，不疼不疼】",
        "【成就 “头铁” 已达成】",
        "【此路不通，谢谢】",
        "【不要撞了南墙接着回头去撞北墙！！！】",
        "【体质+1】"
    ],
    hitSelf: [
        "【人饿极了连自己都咬吗？】",
        "【对自己有点狠了吧！】",
        "【成就“饕餮”已达成】",
        "【这是什么操作？？？】",
        "【迷惑行为+1】",
        "【动保协会表示强烈反对！】",
        "【咦！看起来好疼】"
    ],
    gameOver: [
        "【没事的，可以开启无敌模式！】",
        "【叮！体验时长已结束，请续费1000r以继续】",
        "【猜猜还有多少互动语音】",
        "【加油！离1000分只差一点了（或两点，不会有人还差三点吧）】",
        "【下班了耶！】",
        "【头疼不疼】",
        "【看起来傻傻的，但很努力】",
        "【再来一次？这次能活到多少分呢？】",
        "【温馨提示，可以通过吃便便来减少身体长度】"
    ]
};
